# MaximumPoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline..::..MaximumPoint Property
Outline Class See Also
---
The maximum point of the bounding box.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public XYZ MaximumPoint { get; set; }
```

Visual Basic
---
```text
Public Property MaximumPoint As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ MaximumPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Outline Class
Autodesk.Revit.DB Namespace